examples/issue-40.dbml.dot
digraph dbml {
      rankdir=LR;
      graph [fontname="helvetica", fontsize=32, fontcolor="#29235c", bgcolor="transparent"];
      node [penwidth=0, margin=0, fontname="helvetica", fontsize=32, fontcolor="#29235c"];
      edge [fontname="helvetica", fontsize=32, fontcolor="#29235c", color="#29235c"];

      
      
      "countries" [id="countries";label=<<TABLE BORDER="2" COLOR="#29235c" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
      <TR><TD PORT="f0" BGCOLOR="#1d71b8"><FONT COLOR="#ffffff"><B>       countries       </B></FONT></TD></TR>
<TR><TD ALIGN="LEFT" PORT="f1" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT"><B>code</B>    </TD>
          <TD ALIGN="RIGHT"><FONT><I>int</I></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="LEFT" PORT="f2" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">name    </TD>
          <TD ALIGN="RIGHT"><FONT><I>varchar</I></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
    </TABLE>>];
"users" [id="users";label=<<TABLE BORDER="2" COLOR="#29235c" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
      <TR><TD PORT="f0" BGCOLOR="#1d71b8"><FONT COLOR="#ffffff"><B>       users       </B></FONT></TD></TR>
<TR><TD ALIGN="LEFT" PORT="f1" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT"><B>id</B>    </TD>
          <TD ALIGN="RIGHT"><FONT><I>int</I></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="LEFT" PORT="f2" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">full_name    </TD>
          <TD ALIGN="RIGHT"><FONT><I>varchar</I></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="LEFT" PORT="f3" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">country_code    </TD>
          <TD ALIGN="RIGHT"><FONT><I>int</I></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
    </TABLE>>];
"merchants" [id="merchants";label=<<TABLE BORDER="2" COLOR="#29235c" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
      <TR><TD PORT="f0" BGCOLOR="#1d71b8"><FONT COLOR="#ffffff"><B>       merchants       </B></FONT></TD></TR>
<TR><TD ALIGN="LEFT" PORT="f1" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT"><B>id</B>    </TD>
          <TD ALIGN="RIGHT"><FONT><I>int</I></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="LEFT" PORT="f2" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">name    </TD>
          <TD ALIGN="RIGHT"><FONT><I>varchar</I></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="LEFT" PORT="f3" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">country_code    </TD>
          <TD ALIGN="RIGHT"><FONT><I>int</I></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="LEFT" PORT="f4" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">admin_id    </TD>
          <TD ALIGN="RIGHT"><FONT><I>int</I></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
    </TABLE>>];
"products" [id="products";label=<<TABLE BORDER="2" COLOR="#29235c" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
      <TR><TD PORT="f0" BGCOLOR="#1d71b8"><FONT COLOR="#ffffff"><B>       products       </B></FONT></TD></TR>
<TR><TD ALIGN="LEFT" PORT="f1" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT"><B>id</B>    </TD>
          <TD ALIGN="RIGHT"><FONT><I>int</I></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="LEFT" PORT="f2" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">name    </TD>
          <TD ALIGN="RIGHT"><FONT><I>varchar</I></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="LEFT" PORT="f3" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">merchant_id    </TD>
          <TD ALIGN="RIGHT"><FONT><I>int</I></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="LEFT" PORT="f4" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">country_code    </TD>
          <TD ALIGN="RIGHT"><FONT><I>int</I></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
    </TABLE>>];
      "products":f0 -> "merchants":f0 [style=invis, weight=100, color=red]
    "products":f3:e -> "merchants":f1:w [dir=forward, penwidth=3, color="#29235c", headlabel="1", taillabel="*"]
"products":f0 -> "countries":f0 [style=invis, weight=100, color=red]
    "products":f4:e -> "countries":f1:w [dir=forward, penwidth=3, color="#29235c", headlabel="1", taillabel="*"]
"users":f0 -> "countries":f0 [style=invis, weight=100, color=red]
    "users":f3:e -> "countries":f1:w [dir=forward, penwidth=3, color="#29235c", headlabel="1", taillabel="*"]
"merchants":f0 -> "countries":f0 [style=invis, weight=100, color=red]
    "merchants":f3:e -> "countries":f1:w [dir=forward, penwidth=3, color="#29235c", headlabel="1", taillabel="*"]
"merchants":f0 -> "users":f0 [style=invis, weight=100, color=red]
    "merchants":f4:e -> "users":f1:w [dir=forward, penwidth=3, color="#29235c", headlabel="1", taillabel="*"]
      
    }
